app/controllers/account_plans_controller.rb

  def index
    @search = AccountPlan.search(params[:search])
---
SELECT * FROM `account_plans` ORDER BY account_id ASC, position ASC

  def show
    @account_plan = AccountPlan.find(params[:id])
---
SELECT * FROM `account_plans` WHERE (`account_plans`.`id` = 1) ORDER BY account_id ASC, position ASC

  def edit
    @account_plan = AccountPlan.find(params[:id])
---
SELECT * FROM `account_plans` WHERE (`account_plans`.`id` = 1) ORDER BY account_id ASC, position ASC

  def create
    @account_plan = AccountPlan.new(params[:account_plan])

    respond_to do |format|
      if @account_plan.save
---
INSERT INTO "account_plans" ("name", "position", "created_at", "comments", "updated_at", "account_id") VALUES('Assets', 1, '2010-05-30 09:33:43', '-', '2010-05-30 09:33:43', '100000')

  def update
    @account_plan = AccountPlan.find(params[:id])

    respond_to do |format|
      if @account_plan.update_attributes(params[:account_plan])
---
SELECT * FROM `account_plans` WHERE (`account_plans`.`id` = 1) ORDER BY account_id ASC, position ASC
UPDATE "account_plans" SET "updated_at" = '2010-05-30 09:34:11', "account_id" = '200000' WHERE "id" = 2