app/controllers/menus_controller.rb

SELECT * FROM `menus`
---
  def index
    @menus = Menu.all

SELECT * FROM `menus` WHERE (`menus`.`id` = 1)
---
  def show
    @menu = Menu.find(params[:id])

INSERT INTO `menus` (`name`, `created_at`, `updated_at`, `htmllink`, `parent_id`, `description`, `target`) VALUES('Report Categories', '2010-06-19 18:59:35', '2010-06-19 18:59:35', '/reports_categories', NULL, 'This shows the report categories', '_self')
---
  def create
    @menu = Menu.new(params[:menu])
    if @menu.save

SELECT * FROM `menus` WHERE (`menus`.`id` = 1)
---
  def edit
    @menu = Menu.find(params[:id])

SELECT * FROM `menus` WHERE (`menus`.`id` = 1)
---
  def update
    @menu = Menu.find(params[:id])