app/controllers/reports_controller.rb

  def index
    @reports = Report.order
---
SELECT * FROM `reports` ORDER BY report_category_id ASC, position ASC

  def report_line
    Report.find(params[:id]).report_lines.create(params[:report_line])
---
INSERT INTO "report_lines" ("position", "record_validity", "created_at", "comments", "updated_at", "uo", "record_visibility", "line_morphing", "created_by", "report_id", "line_id", "line_style", "updated_by", "parent_line_id", "line_caption", "updated_with") VALUES(1, 't', '2010-06-13 21:17:36', 'This is a new line', '2010-06-13 21:17:36', '+', 't', NULL, '-', 2, 'GB18_222', NULL, '-', NULL, 'Form 18 Line 22', '-')
SELECT "report_lines".id FROM "report_lines" WHERE ("report_lines"."line_id" = 'GB8_Line22') LIMIT 1
SELECT * FROM `reports` WHERE (`reports`.`id` = 1) ORDER BY position ASC

  def prioritize_report_lines
  report = Report.find(params[:id])
  report_lines = report.report_lines
  report_lines.each do |report_line|
    report_line.position = params['report_line'].index(report_line.id.to_s) + 1
    report_line.save
---
SELECT * FROM `reports` WHERE (`reports`.`id` = 1) ORDER BY position ASC
SELECT `report_lines`.id FROM `report_lines` WHERE (`report_lines`.`line_id` = BINARY '12' AND `report_lines`.id <> 1) LIMIT 1
UPDATE "report_lines" SET "updated_at" = '2010-06-05 19:10:04', "position" = NULL WHERE "id" = 1

  def show
    @report = Report.find(params[:id])
---
SELECT * FROM `reports` WHERE (`reports`.`id` = 4) ORDER BY report_category_id ASC, position ASC

  def edit
    @report = Report.find(params[:id])
---
SELECT * FROM `reports` WHERE (`reports`.`id` = 3) ORDER BY report_category_id ASC, position ASC

  def create
    @report = Report.new(params[:report])

    respond_to do |format|
      if @report.save
---
INSERT INTO "reports" ("reference", "name", "position", "record_validity", "created_at", "comments", "updated_at", "record_visibility", "created_by", "updated_by", "report_category_id", "updated_with") VALUES('12', 'report 12', 1, 't', '2010-06-13 17:04:29', 'This is a comment', '2010-06-13 17:04:29', 't', '-', '-', 1, '-')

  def update
    @report = Report.find(params[:id])

    respond_to do |format|
      if @report.update_attributes(params[:report])
---
SELECT * FROM `reports` WHERE (`reports`.`id` = 3) ORDER BY report_category_id ASC, position ASC
UPDATE "reports" SET "updated_at" = '2010-06-13 21:03:33', "comments" = 'This is a comment aussi', "position" = 3 WHERE "id" = 1

  def destroy
    @report = Report.find(params[:id])
    @report.destroy
---
SELECT * FROM "reports" WHERE ("reports"."id" = 5)
DELETE FROM "reports" WHERE "id" = 5