app/controllers/report_categories_controller.rb

  def index
    @report_categories = ReportCategory.all(:order => 'name')
---
SELECT * FROM `report_categories` ORDER BY name ASC

  def report
    ReportCategory.find(params[:id]).reports.create(params[:report])
---
INSERT INTO "reports" ("reference", "name", "position", "record_validity", "created_at", "comments", "updated_at", "record_visibility", "created_by", "updated_by", "report_category_id", "updated_with") VALUES('1', 'Report 1', 2, 't', '2010-06-13 18:31:45', 'This is a comment', '2010-06-13 18:31:45', 't', '-', '-', 1, '-')
SELECT * FROM "report_categories" WHERE ("report_categories"."id" = 3)
SELECT * FROM "reports" WHERE ("reports".report_category_id = 1)

  def show
    @report_category = ReportCategory.find(params[:id])
---
SELECT * FROM `report_categories` WHERE (`report_categories`.`id` = 4) ORDER BY name ASC

  def edit
    @report_category = ReportCategory.find(params[:id])
---
SELECT * FROM `report_categories` WHERE (`report_categories`.`id` = 4) ORDER BY name ASC

  def prioritize_reports
  report_category = ReportCategory.find(params[:id])
  reports = report_category.reports
  reports.each do |report|
    report.position = params['report'].index(report.id.to_s) + 1
    report.save
---
SELECT * FROM `report_categories` WHERE (`report_categories`.`id` = 1)
SELECT * FROM `reports` WHERE (`reports`.report_category_id = 1) ORDER BY report_category_id ASC, position ASC
UPDATE `reports` SET `updated_at` = '2010-06-14 22:01:25', `position` = 2 WHERE `id` = 2

  def create
    @report_category = ReportCategory.new(params[:report_category])

    respond_to do |format|
      if @report_category.save
---
INSERT INTO "report_categories" ("name", "record_validity", "created_at", "comments", "category_kind", "updated_at", "record_visibility", "created_by", "category_type_description", "category_type", "updated_by", "report_category_id", "updated_with") VALUES('GreenBook', 't', '2010-06-12 23:30:26', '-', 'GB', '2010-06-12 23:30:26', 't', '-', 'Accounting', 'ACT', '-', 'Cat1', '-')

  def update
    @report_category = ReportCategory.find(params[:id])

    respond_to do |format|
      if @report_category.update_attributes(params[:report_category])
---
SELECT * FROM `report_categories` WHERE (`report_categories`.`id` = 4) ORDER BY name ASC
UPDATE `report_categories` SET `updated_at` = '2010-06-21 15:01:28', `comments` = 'This is the balance sheet category !' WHERE `id` = 3