app/controllers/report_lines_controller.rb

  def index
    @report_lines = ReportLine.all(:order => 'position')
---
SELECT * FROM `report_lines` ORDER BY report_id ASC, position ASC

  def structure
    ReportLine.find(params[:id]).structures.create(params[:structure])
---
INSERT INTO "structures" ("created_at", "account_plan_id", "comments", "updated_at", "report_line_id") VALUES('2010-05-31 19:48:56', 2, '-', '2010-05-31 19:48:56', 2)
SELECT "structures".id FROM "structures" WHERE ("structures"."report_line_id" = 3 AND "structures".account_plan_id = 2) LIMIT 1
SELECT * FROM "report_lines" WHERE ("report_lines"."id" = 2)

  def show
    @report_line = ReportLine.find(params[:id])
---
SELECT * FROM `report_lines` WHERE (`report_lines`.`id` = 5) ORDER BY report_id ASC, position ASC

  def edit
    @report_line = ReportLine.find(params[:id])
---
SELECT * FROM `report_lines` WHERE (`report_lines`.`id` = 5) ORDER BY report_id ASC, position ASC

  def create
    @report_line = ReportLine.new(params[:report_line])

    respond_to do |format|
      if @report_line.save
---
INSERT INTO "report_lines" ("position", "record_validity", "created_at", "comments", "updated_at", "uo", "record_visibility", "line_morphing", "created_by", "report_id", "line_id", "line_style", "updated_by", "parent_line_id", "line_caption", "updated_with") VALUES(4, 't', '2010-06-13 21:38:49', 'new comment', '2010-06-13 21:38:49', '+', 't', '', '-', 2, 'GB18_234', '', '-', 'GB18_23', 'Form 18 Line 25', '-')

  def update
    @report_line = ReportLine.find(params[:id])

    respond_to do |format|
      if @report_line.update_attributes(params[:report_line])
---
SELECT `report_lines`.id FROM `report_lines` WHERE (`report_lines`.`line_id` = BINARY 'RPT63_765' AND `report_lines`.id <> 5) LIMIT 1
UPDATE `report_lines` SET `updated_at` = '2010-06-19 23:19:06', `report_id` = 3, `parent_line_id` = '', `line_style` = '', `line_morphing` = '' WHERE `id` = 5

  def destroy
    @report_line = ReportLine.find(params[:id])
    @report_line.destroy
---
SELECT * FROM "report_lines" WHERE ("report_lines"."id" = 5)
DELETE FROM "report_lines" WHERE "id" = 5