app/controllers/tasklists_controller.rb

  def index
    @search = Tasklist.search(params[:search])
---
SELECT * FROM `tasklists`

  def show
    @tasklist = Tasklist.find(params[:id])
---
SELECT * FROM `tasklists` WHERE (`tasklists`.`id` = 1)

  def create
    @users = User.find(:all)
    @projects = Project.find(:all)
    @tasklist = Tasklist.new(params[:tasklist])
    if @tasklist.save
---
INSERT INTO `tasklists` (`name`, `scope`, `created_at`, `project_id`, `updated_at`, `priority`, `user_id`, `genre`, `due_date`, `description`, `status`) VALUES('Test', 'Basel II', '2010-06-19 20:38:18', 2, '2010-06-19 20:38:18', 'Medium', 1, 'New Control', '2010-06-10', 'test', 'To start')

  def edit
    @users = User.find(:all)
    @tasklist = Tasklist.find(params[:id])
---
SELECT * FROM `tasklists` WHERE (`tasklists`.`id` = 3)

  def update
    @users = User.find(:all)
    @projects = Project.find(:all)
    @tasklist = Tasklist.find(params[:id])
    if @tasklist.update_attributes(params[:tasklist])
---
SELECT * FROM `tasklists` WHERE (`tasklists`.`id` = 3)
UPDATE `tasklists` SET `updated_at` = '2010-06-19 21:11:29', `priority` = 'Medium', `status` = 'In progress' WHERE `id` = 3