app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`name`, `shortname`, `created_at`, `single_access_token`, `last_request_at`, `crypted_password`, `updated_at`, `perishable_token`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('vincent', 'vincent', '2010-06-19 18:37:50', 'xBnIdgaChnsw8mGF-bYd', '2010-06-19 18:37:50', '526fed9f1aca8276c1324707dffb0c16f34d70606621f81e1ee548c6c658a504cd02c1f5c79de82848f932480347b39d99032cd49b94a02fed40e8f4380e4a23', '2010-06-19 18:37:50', 'hjetQIqGIjnsjoCNyZtF', 0, '127.0.0.1', 'nKHKfu0KDBPZhEzlLygD', '2010-06-19 18:37:50', '2aaa4ecc28f64e735c22dbe60d840cd26b19b19cd877ab78a6e9cc16e711f60c063e23900cd7f0f396a0a611eec5558b5485fc024ea8241906df394fb737cf32', 1, NULL, 'vincent', NULL, 'vincent@test.com')